pub/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-28 Thu 02:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Index</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://gongzhitaao.org/orgcss/org.css" type="text/css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.10.0/styles/googlecode.min.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="/about.html">about</a>
</div>
<div id="content">
<h1 class="title">Index</h1>
<p>
Hi there! I'm going to write something about Ruby, Emacs, Java, Linux, CI/CD, Nginx and other interesting stuff
</p>

<ul class="org-ul">
<li><a href="config.html">This site config</a></li>
<li><a href="linux/nvidia/optimus/libglvnd/2020/03/10/nvidia-libglvnd.html">Nvidia Optimus: libglvnd</a></li>
<li><a href="linux/gentoo/kde/wallet/2019/11/11/kdewallet-asks-password.html">Updated /etc/pam.d/sddm but kde wallet still asks password</a></li>
<li><a href="linux/nvidia/optimus/systemd/2019/11/05/nvidia-optimus-systemd.html">Nvidia Optimus: Switch on Boot with Systemd</a></li>
<li><a href="linux/gentoo/nvidia/optimus/2019/04/22/gentoo-nvidia-optimus.html">Nvidia Optimus: Switch on Boot</a></li>
<li><a href="skype/tray/icon/2018/11/08/skypeforlinux-fix-tray-icon.html">Skypeforlinux: fix tray icon</a></li>
<li><a href="raspberry/pi/3/golang/2017/08/27/raspberry-pi-install-golang.html">Raspberry Pi 3 Install Golang</a></li>
<li><a href="docker/overlay/namespace/2017/08/14/nsenter-invalid-argument.html">Nsenter Invalid Argument</a></li>
<li><a href="docker/overlay/namespace/2017/08/28/docker-overlay-network.html">Docker overlay network</a></li>
<li><a href="emacs/2017/07/23/emacs-font-face.html">Emacs font face</a></li>
<li><a href="devops/2017/03/28/devops-tech-interview-question.html">The question from a DevOps interview</a></li>
<li><a href="xscreensaver/2017/02/24/xscreensaver-text-message.html">XScreenSaver: customize the message of the day</a></li>
<li><a href="sha1/2017/02/23/sha-1-collision.html">The first collision for full SHA-1</a></li>
<li><a href="xcode/2017/02/11/xcode-expected-expression.html">Xcode: Expected expression</a></li>
<li><a href="vagrant/2017/02/10/vagrant_vagrant-persistent-storage_plugin.html">Vagrant: persistent storage plugin</a></li>
<li><a href="java/maven/2016/09/24/maven-start.html">Maven start</a></li>
<li><a href="jokes/2016/05/09/so_my_girlfriend_said.html">My Girlfriend Said</a></li>
<li><a href="rails/rake/todo/2016/05/07/rake-notes-keep-todos-in-rails-code.html">rake notes - keep your TODOs in the code</a></li>
<li><a href="bash/regexp/2016/04/14/split-numbers-by-three.html">Split number by groups with three digits</a></li>
<li><a href="ruby/2016/04/12/ruby-object-graph.html">Ruby Objects Graph</a></li>
<li><a href="gtk2/perl/2016/03/30/tray-icons-perl.html">Gtk2 Icon Perl Example</a></li>
<li><a href="nginx/2016/02/10/nginx-limit-reqs.html">Limit requests in Nginx</a></li>
</ul>
</div>
<div id="postamble" class="status">
2020
</div>
</body>
</html>
